jpnorair/OpenTag/include/board/stm32wl55xx/nucleo_wl55.h
/* Copyright 2013-2014 JP Norair
 * Licensed under the OpenTag License, Version 1.0 (the "License");
  * you may not use this file except in compliance with the License.
  * You may obtain a copy of the License at
  *
  * http://www.indigresso.com/wiki/doku.php?id=opentag:license_1_0
  *
  * Unless required by applicable law or agreed to in writing, software
  * distributed under the License is distributed on an "AS IS" BASIS,
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  */
/**
  * @file       /board/stm32wl55xx/nucleo_wl55.h
  * @author     JP Norair
  * @version    R100
  * @date       19 Jan 2022
  * @brief      Board Configuration for ST Nucleo WL55
  * @ingroup    Platform
  *
  * Do not include this file, include /platform/config.h
  *
  * SPECIAL NOTE: search for "note BOARD Macro" lines in this file.  These
  * must be ported to other STM32L boards, because the OpenTag STM32L platform 
  * implementation depends on them. 
  *
  ******************************************************************************
  */
  

#ifndef __nucleo_wl55_H
#define __nucleo_wl55_H

/// MCU definition for the board must be the first thing.
#define __STM32WL55JC__

#include <app/app_config.h>
#include <platform/hw/STM32WLxx_config.h>
#include <platform/interrupts.h>

/// Right here it's stipulated what features CPU1 gets to control.
#ifndef MCU_PARAM_CPU1NULL
#   define MCU_PARAM_CPU1NULL   1
#endif
#ifndef MCU_PARAM_CPU2PWR
#   define MCU_PARAM_CPU2PWR    (1 && MCU_PARAM_CPU1NULL)
#endif


#if OT_FEATURE(M2)
#   define __USE_RADIO
#endif


/// Macro settings: ENABLED, DISABLED, NOT_AVAILABLE
#ifdef ENABLED
#   undef ENABLED
#endif
#define ENABLED  1

#ifdef DISABLED
#   undef DISABLED
#endif
#define DISABLED  0

#ifdef NOT_AVAILABLE
#   undef NOT_AVAILABLE
#endif
#define NOT_AVAILABLE   DISABLED


/// Configuration of system with or without Radio
#if defined(__USE_RADIO)
#   ifdef __NULL_RADIO__
#       include <io/radio_null/config.h>
#   else
#       define __LORA__
#		define __STM32WL_LORA__
#		define __STM32WL_22dBm__
#       define __STM32WL_15dBm__
#       include <io/stm32wl_lora/config.h>
#   endif
#endif



/** Additional RF Front End Parameters and Settings <BR>
  * ========================================================================<BR>
  * We assume you are using the included antenna and matching circuit, which 
  * has a 50% efficiency (-3dB) with 1dB insertion loss
  */
#ifdef __USE_RADIO
#   ifndef RF_PARAM_BAND
#   define RF_PARAM_BAND    915
#   endif
#   define RF_HDB_ATTEN     4                //Half dB attenuation (units = 0.5dB), used to scale TX power
#   define RF_HDB_RXATTEN   4
#   define RF_RSSI_OFFSET   RF_HDB_RXATTEN   //Offset applied to RSSI calculation
#endif



/** MCU Configuration settings      <BR>
  * ========================================================================<BR>
  * Implemented capabilities of the STM32WL variants on this board/build
  *
  * On this board you can use USB or UART for MPipe, I2C is not implemented
  * yet.  To select USB, make sure "MCU_CONFIG_MPIPECDC" is set to "ENABLED".
  * To use UART, set "MCU_CONFIG_MPIPECDC" to "DISABLED" and the script 
  * below will use UART instead.
  *
  */
#define MCU_CONFIG(VAL)                 MCU_CONFIG_##VAL   // FEATURE 
#define MCU_CONFIG_MULTISPEED           DISABLED                            // Allows usage of MF-HF clock boosting
#define MCU_CONFIG_MAPEEPROM            DISABLED
#define MCU_CONFIG_MPIPEI2C             (NOT_AVAILABLE && !MCU_CONFIG_MPIPECDC)
#define MCU_CONFIG_MPIPEUART            (ENABLED && !MCU_CONFIG_MPIPEI2C)
#define MCU_CONFIG_MEMCPYDMA            ENABLED                             // MEMCPY DMA should be lower priority than MPIPE DMA
#define MCU_CONFIG_USB                  (MCU_CONFIG_MPIPECDC == ENABLED)
#define MCU_CONFIG_VOLTLEVEL            2




/** Platform Memory Configuration <BR>
  * ========================================================================<BR>
  * OpenTag needs to know where it can put Nonvolatile memory (file system) and
  * how much space it can allocate for filesystem.  For this configuration, 
  * Veelite is put into EEPROM.
  *
  * The STM32L0 uses 128 byte Flash pages and 2KB Flash sectors.  Therefore, it
  * is best to allocate the FS in Flash on 2KB boundaries because this is the 
  * resolution that can be write protected (or, as with FS, *NOT* write 
  * protected).  Best practice with STM32 chips is to put the FS at the back of
  * of the Flash space because this seems to work best with the debugger HW.
  */

// For building with non-default memory amounts
#ifndef SRAM_SIZE
#   define SRAM_SIZE            (16*1024)
#endif
#ifndef EEPROM_SIZE
#   define EEPROM_SIZE          (0*1024)
#endif
#ifndef FLASH_SIZE
#   define FLASH_SIZE           (64*1024)
#endif
#ifndef EEPROM_SAVE_SIZE
#   define EEPROM_SAVE_SIZE     (0)
#endif


// If not using EEPROM (using Flash) you need to coordinate some of these Flash Addresses
// with those entered into the Linker Script.  Use the vlsram linker script.
#ifndef __VLSRAM__
#   define __VLSRAM__
#endif
#define FLASH_FS_END         (0x08040000)
#define FLASH_NUM_PAGES      (FLASH_SIZE/FLASH_PAGE_SIZE)
#define FLASH_FS_ALLOC       (4*1024) 							// 4KB FS memory
#define FLASH_FS_ADDR        (FLASH_FS_END-FLASH_FS_ALLOC)	    // FS Flash Start Addr
#define FLASH_FS_PAGES       (FLASH_FS_ALLOC / FLASH_PAGE_SIZE)
#define FLASH_FS_FALLOWS     (0)			                        // No fallows







/** Board-based Feature Settings <BR>
  * ========================================================================<BR>
  * 1. One button is supported on PB2.  It is the "User" button that comes with
  *    the discovery board.
  * 
  * 2. There are many LEDs available:
  *    <LI> LD1, Green, PB5.  It is used as TRIG2 to show RF TX active. </LI>
  *    <LI> LD2, Red, PA5.  It is used as TRIG1 to show RF RX active. </LI>
  *    <LI> LD3, Blue, PB6.  It is unused. </LI>
  *    <LI> LD4, Red, PB7.  It is unused. </LI>
  *
  * 3. MPIPE can support UART TX/RX (no flow control) or I2C.  MPIPE supports
  *    a "break" mode, in both I2C and UART interfaces, where a break character 
  *    is transmitted by the client ahead of the packet in order to wakeup the 
  *    system.  This reduces power requirements.  Unfortunately, short-sighted
  *    design of the LoRa expansion board prevents the Break feature from 
  *    working on this board.
  *
  * 4. The Debug and Upload interface is SWD.  There is no serial bootloader
  *    capability at the time of writing.  
  *    (Editorial Note: A ST-Link-V2 has SWD and a low price of US$25.  
  *    It can work with OpenOCD, so the toolchain is still very cheap.)
  * 
  * 5. The SX127x SPI benefits from the highest speed clock up to 20 MHz.
  */
#define BOARD_FEATURE(VAL)              BOARD_FEATURE_##VAL
#define BOARD_PARAM(VAL)                BOARD_PARAM_##VAL

#define BOARD_FEATURE_MPIPE             ENABLED
#define BOARD_FEATURE_USBCONVERTER      BOARD_FEATURE_MPIPE         // Is UART connected via USB converter?
#define BOARD_FEATURE_MPIPE_BREAK       ENABLED                    // Send/receive leading break for wakeup
#define BOARD_FEATURE_MPIPE_DIRECT      (BOARD_FEATURE_MPIPE_BREAK != ENABLED) 

#define BOARD_FEATURE_I2C               DISABLED

