jpnorair/OpenTag/include/board/stm32wl55xx/nucleo_wl55.h
// MPIPE UART modes are deprecated.  Only Break-mode or Direct-Mode should be used.
//#define BOARD_FEATURE_MPIPE_CS          DISABLED                    // Chip-Select / DTR wakeup control
//#define BOARD_FEATURE_MPIPE_FLOWCTL     DISABLED                    // RTS/CTS style flow control 

#ifndef BOARD_FEATURE_LFXTAL
#define BOARD_FEATURE_LFXTAL            ENABLED                                 // LF XTAL used as Clock source
#endif
#ifndef BOARD_FEATURE_HFXTAL
#define BOARD_FEATURE_HFXTAL            DISABLED                                // HF XTAL used as Clock source
#endif
#ifndef BOARD_FEATURE_HFBYPASS
#define BOARD_FEATURE_HFBYPASS          DISABLED                                // Use an externally driven oscillator
#endif
#ifndef BOARD_FEATURE_RFXTAL
#define BOARD_FEATURE_RFXTAL            ENABLED                                 // XTAL for RF chipset
#endif
#ifndef BOARD_FEATURE_RFXTALOUT
#define BOARD_FEATURE_RFXTALOUT         DISABLED
#endif
#ifndef BOARD_FEATURE_PLL
#define BOARD_FEATURE_PLL               DISABLED
#endif
#ifndef BOARD_FEATURE_STDSPEED
#define BOARD_FEATURE_STDSPEED          (MCU_CONFIG_MULTISPEED == ENABLED)
#endif
#ifndef BOARD_FEATURE_FULLSPEED
#define BOARD_FEATURE_FULLSPEED         ENABLED
#endif
#ifndef BOARD_FEATURE_FULLXTAL
#define BOARD_FEATURE_FULLXTAL          DISABLED
#endif
#ifndef BOARD_FEATURE_FLANKSPEED
#define BOARD_FEATURE_FLANKSPEED        DISABLED
#endif
#ifndef BOARD_FEATURE_FLANKXTAL
#define BOARD_FEATURE_FLANKXTAL         DISABLED
#endif

#if !defined(BOARD_FEATURE_RF_PABOOST)
#	if !defined(__SX127x_PABOOST__)
#	define BOARD_FEATURE_RF_PABOOST		DISABLED
#	else
#	define BOARD_FEATURE_RF_PABOOST		ENABLED
#	endif
#endif

// Number of Triggers/LEDs
#ifndef BOARD_PARAM_TRIGS
#   define BOARD_PARAM_TRIGS            3
#endif

// Number of Switches
#ifndef BOARD_PARAM_SWITCHES
#   define BOARD_PARAM_SWITCHES         3
#endif

// MPIPE speed: ignored with USB MPipe.  
// Actual speed will be closest supported bps.
#define BOARD_PARAM_MPIPEBAUD           115200

// Clock descriptions
#define BOARD_PARAM_LFHz                32768
#define BOARD_PARAM_LFtol               0.00002

#define BOARD_PARAM_MFHz                48000000
#define BOARD_PARAM_MFmult              1                       // Main CLK = HFHz * (MFmult/MFdiv)
#define BOARD_PARAM_MFdiv               1
#define BOARD_PARAM_MFtol               0.05

#ifndef BOARD_PARAM_HFHz
#define BOARD_PARAM_HFHz                16000000
#endif
#ifndef BOARD_PARAM_HFtol
#define BOARD_PARAM_HFtol               0.01
#endif
#ifndef BOARD_PARAM_HFppm
#define BOARD_PARAM_HFppm               20000
#endif

#define BOARD_PARAM_RFHz                32000000
#define BOARD_PARAM_RFdiv               1
#define BOARD_PARAM_RFout               (BOARD_PARAM_RFHz/BOARD_PARAM_RFdiv)
#define BOARD_PARAM_RFtol               0.000002
#define BOARD_PARAM_PLLout              96000000
#define BOARD_PARAM_PLLmult             (BOARD_PARAM_PLLout/BOARD_PARAM_HFHz)
#define BOARD_PARAM_PLLdiv              3
#define BOARD_PARAM_PLLHz               (BOARD_PARAM_PLLout/BOARD_PARAM_PLLdiv)

// Clock divider specs: These are defined at FULL SPEED
#define BOARD_PARAM_AHBCLKDIV           1                       // AHB Clk = Main CLK / AHBCLKDIV
#define BOARD_PARAM_APB2CLKDIV          1                       // APB2 Clk = Main CLK / AHBCLKDIV
#define BOARD_PARAM_APB1CLKDIV          1                       // APB1 Clk = Main CLK / AHBCLKDIV

// SWD Interface: Nucleo used SWD in all cases, never JTAG.
#define BOARD_SWDIO_PORT                GPIOA
#define BOARD_SWDIO_PINNUM              13
#define BOARD_SWDIO_PIN                 (1<<13)
#define BOARD_SWDCLK_PORT               GPIOA
#define BOARD_SWDCLK_PINNUM             14
#define BOARD_SWDCLK_PIN                (1<<14)
#define BOARD_TRACESWO_PORTNUM          1
#define BOARD_TRACESWO_PORT             GPIOB
#define BOARD_TRACESWO_PINNUM           (1<<3)
#define BOARD_TRACESWO_PIN              3

// B1, B2, B3 are active-low on pins PA0, PA1, PC6
#define BOARD_SW1_PORTNUM               0
#define BOARD_SW1_PORT                  GPIOA
#define BOARD_SW1_PINNUM                0
#define BOARD_SW1_PIN                   (1<<BOARD_SW1_PINNUM)
#define BOARD_SW1_POLARITY              0
#define BOARD_SW1_PULLING               1
#define BOARD_SW2_PORTNUM               0
#define BOARD_SW2_PORT                  GPIOA
#define BOARD_SW2_PINNUM                1
#define BOARD_SW2_PIN                   (1<<BOARD_SW1_PINNUM)
#define BOARD_SW2_POLARITY              0
#define BOARD_SW2_PULLING               1
#define BOARD_SW3_PORTNUM               2
#define BOARD_SW3_PORT                  GPIOC
#define BOARD_SW3_PINNUM                6
#define BOARD_SW3_PIN                   (1<<BOARD_SW1_PINNUM)
#define BOARD_SW3_POLARITY              0
#define BOARD_SW3_PULLING               1

// LED interface is implemented on PB9, PB11, PB15
// Green, Red, and Blue LEDs are available
// These LEDs are also acting as triggers 1, 2, 3
#define BOARD_LEDG_PORTNUM              1                   // PB9
#define BOARD_LEDG_PORT                 GPIOB
#define BOARD_LEDG_PINNUM               9
#define BOARD_LEDG_PIN                  (1<<BOARD_LEDG_PINNUM)
#define BOARD_LEDG_POLARITY             1
#define BOARD_LEDR_PORTNUM              1                   // PB11
#define BOARD_LEDR_PORT                 GPIOB
#define BOARD_LEDR_PINNUM               11
#define BOARD_LEDR_PIN                  (1<<BOARD_LEDR_PINNUM)
#define BOARD_LEDR_POLARITY             1
#define BOARD_LEDB_PORTNUM              1                   // PB15
#define BOARD_LEDB_PORT                 GPIOB
#define BOARD_LEDB_PINNUM               15
#define BOARD_LEDB_PIN                  (1<<BOARD_LEDB_PINNUM)
#define BOARD_LEDB_POLARITY             1

// Supplemental Triggers
// Optional Triggers to use for testing are implemented on:
// PC0, PC1, PC2
#if (BOARD_PARAM_TRIGS > 6)
#   error "This board does not support more than 6 triggers."
#endif
#if (BOARD_PARAM_TRIGS > 3)
#   define BOARD_TRIG5_PORTNUM          2                   // PC0
#   define BOARD_TRIG5_PORT             GPIOC
#   define BOARD_TRIG5_PINNUM           0
#   define BOARD_TRIG5_PIN              (1<<BOARD_TRIG5_PINNUM)
#endif
#if (BOARD_PARAM_TRIGS > 4)
#   define BOARD_TRIG5_PORTNUM          2                   // PC1
#   define BOARD_TRIG5_PORT             GPIOC
#   define BOARD_TRIG5_PINNUM           1
#   define BOARD_TRIG5_PIN              (1<<BOARD_TRIG5_PINNUM)
#endif
#if (BOARD_PARAM_TRIGS > 5)
#   define BOARD_TRIG6_PORTNUM          2                   // PC2
#   define BOARD_TRIG6_PORT             GPIOC
#   define BOARD_TRIG6_PINNUM           2
#   define BOARD_TRIG6_PIN              (1<<BOARD_TRIG6_PINNUM)
#endif


