jpnorair/OpenTag/include/board/stm32wl55xx/nucleo_wl55.h
// RF Front-end GPIO
// STM32WL has internal RF connections for most requirements.
// Front-end control and TCXO control are the main exceptions.
// This is to give power to the TCXO
#define BOARD_RF_TCXOPORTNUM			1		//PB0
#define BOARD_RF_TCXOPORT               GPIOB
#define BOARD_RF_TCXOPINNUM             0
#define BOARD_RF_TCXOPIN  			    (1<<BOARD_RF_TCXOPINNUM)

// Antenna Switch Pins
#define BOARD_RF_CTLPORTNUM             2		//PC4, PC5, PC3
#define BOARD_RF_CTLPORT                GPIOC
#define BOARD_RF_CTL1PORTNUM            BOARD_RF_CTLPORTNUM
#define BOARD_RF_CTL2PORTNUM            BOARD_RF_CTLPORTNUM
#define BOARD_RF_CTL3PORTNUM            BOARD_RF_CTLPORTNUM
#define BOARD_RF_CTL1PORT               BOARD_RF_CTLPORT
#define BOARD_RF_CTL2PORT               BOARD_RF_CTLPORT
#define BOARD_RF_CTL3PORT               BOARD_RF_CTLPORT
#define BOARD_RF_CTL1PINNUM             4
#define BOARD_RF_CTL2PINNUM             5
#define BOARD_RF_CTL3PINNUM             3
#define BOARD_RF_CTL1PIN                (1<<BOARD_RF_CTL1PINNUM)
#define BOARD_RF_CTL2PIN                (1<<BOARD_RF_CTL2PINNUM)
#define BOARD_RF_CTL3PIN                (1<<BOARD_RF_CTL3PINNUM)

// Main serial connections, used at least by MPIPE

// I2C on PA12/PA11 or "D15/D14"
#define BOARD_I2C_PORTNUM               0
#define BOARD_I2C_PORT                  GPIOA
#define BOARD_I2C_ID                    1
#define BOARD_I2C_SCLPINNUM             12
#define BOARD_I2C_SDAPINNUM             11
#define BOARD_I2C_SCLPIN                (1<<BOARD_I2C_SCLPINNUM)
#define BOARD_I2C_SDAPIN                (1<<BOARD_I2C_SDAPINNUM)

// UART on PA2/PA3 to ST-Link (UART2)
#define BOARD_UART_PORTNUM              0
#define BOARD_UART_PORT                 GPIOA
#define BOARD_UART_ID                   2
#define BOARD_UART_TXPINNUM             2
#define BOARD_UART_RXPINNUM             3
#define BOARD_UART_TXPIN                (1<<BOARD_UART_TXPINNUM)
#define BOARD_UART_RXPIN                (1<<BOARD_UART_RXPINNUM)

// EXTUART on PB6/PB7 to D0,D1 (UART1)
// This is for "Extension UART"
#if 0
#   define BOARD_EXTUART_PORTNUM        1
#   define BOARD_EXTUART_PORT           GPIOB
#   define BOARD_EXTUART_ID             1
#   define BOARD_EXTUART_TXPINNUM       6
#   define BOARD_EXTUART_RXPINNUM       7
#   define BOARD_EXTUART_TXPIN          (1<<BOARD_EXTUART_TXPINNUM)
#   define BOARD_EXTUART_RXPIN          (1<<BOARD_EXTUART_RXPINNUM)
#endif



// ADC Analog inputs on Arduino A0-A5
// PB1, PB2, PA10, PB4, PB14, PB13
///@todo the values below are for a different board, do not use
#if 0
#define BOARD_ADC_PINS                  2
#define BOARD_ADC_PORTS                 1
#define BOARD_ADC_0PORTNUM              0
#define BOARD_ADC_0PORT                 GPIOA
#define BOARD_ADC_0CHAN                 0
#define BOARD_ADC_0PINNUM               0
#define BOARD_ADC_0PIN                  (1<<BOARD_ADC_0PINNUM)
#define BOARD_ADC_1PORTNUM              0
#define BOARD_ADC_1PORT                 GPIOA
#define BOARD_ADC_1CHAN                 4
#define BOARD_ADC_1PINNUM               4
#define BOARD_ADC_1PIN                  (1<<BOARD_ADC_1PINNUM)
#endif


// Timer IO: these are multiplexed onto the IOBUS
///@todo the values below are for a different board, do not use
#if 0
#define BOARD_TIMA_PORTNUM              1
#define BOARD_TIMA_PORT                 GPIOB
#define BOARD_TIMA_ID                   3
#define BOARD_TIMA                      TIM3
#define BOARD_TIMA_CHANS                2
#define BOARD_TIMA_1CHAN                1
#define BOARD_TIMA_2CHAN                2
#define BOARD_TIMA_1PINNUM              4
#define BOARD_TIMA_2PINNUM              5
#define BOARD_TIMA_1PIN                 (1<<BOARD_TIMA_1PINNUM)
#define BOARD_TIMA_2PIN                 (1<<BOARD_TIMA_2PINNUM)
#define BOARD_TIMB_PORTNUM              1
#define BOARD_TIMB_PORT                 GPIOB
#define BOARD_TIMB_ID                   4
#define BOARD_TIMB                      TIM4
#define BOARD_TIMB_CHANS                4
#define BOARD_TIMB_1CHAN                1
#define BOARD_TIMB_2CHAN                2
#define BOARD_TIMB_3CHAN                3
#define BOARD_TIMB_4CHAN                4
#define BOARD_TIMB_1PINNUM              6
#define BOARD_TIMB_2PINNUM              7
#define BOARD_TIMB_3PINNUM              8
#define BOARD_TIMB_4PINNUM              9
#define BOARD_TIMB_1PIN                 (1<<BOARD_TIMB_1PINNUM)
#define BOARD_TIMB_2PIN                 (1<<BOARD_TIMB_2PINNUM)
#define BOARD_TIMB_3PIN                 (1<<BOARD_TIMB_3PINNUM)
#define BOARD_TIMB_4PIN                 (1<<BOARD_TIMB_4PINNUM)
#define BOARD_TIM
#define BOARD_TIMC_PORTNUM              1
#define BOARD_TIMC_PORT                 GPIOB
#define BOARD_TIMC_ID                   10
#define BOARD_TIMC                      TIM10
#define BOARD_TIMC_CHANS                1
#define BOARD_TIMC_1CHAN                1
#define BOARD_TIMC_1PINNUM              8
#define BOARD_TIMC_1PIN                 (1<<BOARD_TIMC_1PINNUM)
#define BOARD_TIMD_PORTNUM              1
#define BOARD_TIMD_PORT                 GPIOB
#define BOARD_TIMD_ID                   11
#define BOARD_TIMD                      TIM11
#define BOARD_TIMD_CHANS                1
#define BOARD_TIMD_1CHAN                1
#define BOARD_TIMD_1PINNUM              9
#define BOARD_TIMD_1PIN                 (1<<BOARD_TIMD_1PINNUM)
#endif



/** BOARD Macros (most of them, anyway) <BR>
  * ========================================================================<BR>
  * BOARD Macros are required by the OpenTag STM32L platform implementation.
  * We can assume certain things at the platform level, but not everything,
  * which is why BOARD Macros are required.
  *
  * If your board is implementing a radio (extremely likely), there are likely
  * some additional Board macros down near the radio configuration section.
  *
  * BOARD_PERIPH_INIT()
  * Initialize peripherals that need to be brought-up at startup (before any
  * driver initializations) because they are critical to operation of core
  * OpenTag libraries.  Generally, this is the DMA, Flash controller, and
  * other such tightly-coupled resources.
  */

// CRC
// The built-in CRC engine is used by Opentag for many things, including the
// pseudo-random number generator.  But it is not used in sleep.
#define _CRCCLK_N           RCC_C2AHB1ENR_CRCEN
#define _CRCCLK_LP          0       /* RCC_C2AHB1SMENR_CRCSMEN */

// DMAMUX is important to enable as long as DMA is enabled (always)
#define _DMAMUXCLK_N        RCC_C2AHB1ENR_DMAMUXEN
#define _DMAMUXCLK_LP       RCC_C2AHB1SMENR_DMAMUXSMEN

// DMA is used in MEMCPY and thus it could be needed at any time.
// CPU2 only uses DMA2
#define _DMA2CLK_N          RCC_C2AHB1ENR_DMA2EN
#define _DMA2CLK_LP         RCC_C2AHB1SMENR_DMA2SMEN


// FLASH
// Flash is always enabled.  This is also its default set up.
#define _FLASHCLK_N         RCC_C2AHB3ENR_FLASHEN
#define _FLASHCLK_LP        RCC_C2AHB3SMENR_FLASHSMEN

// IPCC
// Enabled by default.  If you are not using CPU1, you can set to 0.
#define _IPCCCLK_N          RCC_C2AHB3ENR_IPCCEN

// HSEM
// Enabled by default.  If you are not using CPU1, you can set to 0.
#define _HSEMCLK_N          RCC_C2AHB3ENR_HSEMEN

// RNG
// The built-in Random number generator engine is used for many things, but
// never in sleep.  The clock is kept on.
#define _RNGCLK_N           RCC_C2AHB3ENR_RNGEN
#define _RNGCLK_LP          0   /* RCC_C2AHB3SMENR_RNGSMEN */

// AES
// AES engine is used only for cryptography (and not random number generation),
// so we leave to the responsibility of the driver to turn it on or off.
#define _AESCLK_N           0   /* RCC_C2AHB3ENR_AESEN */
#define _AESCLK_LP          RCC_C2AHB3SMENR_AESSMEN

// PKA
// Public Key engine is used only for cryptography, so we leave to the
// responsibility of the driver to turn it on or off.
#define _PKACLK_N           0   /* RCC_C2AHB3ENR_PKAEN */
#define _PKACLK_LP          RCC_C2AHB3SMENR_PKASMEN

// All clocks for peripherals on APBs must be managed by their individual
// drivers.


// This board enabled all GPIO on ports A, B, C.
// On startup (_SU), port H is also enabled
// On Stop (LP) Port A should be open for UART
// On Stop-with-RF (LPRF), Ports A, B, C should be open
#define _GPIOCLK_N      (RCC_AHB2ENR_GPIOAEN | RCC_AHB2ENR_GPIOBEN | RCC_AHB2ENR_GPIOCEN)
#define _GPIOCLK_SU     (_GPIOCLK_N | RCC_AHB2ENR_GPIOHEN)
#define _GPIOCLK_LP     (RCC_AHB2SMENR_GPIOASMEN)
#define _GPIOCLK_LPRF   (RCC_AHB2SMENR_GPIOASMEN | RCC_AHB2SMENR_GPIOBSMEN | RCC_AHB2SMENR_GPIOCSMEN)
    

//@note BOARD Macro for Peripheral Clock initialization at startup
static inline void BOARD_PERIPH_INIT(void) {
    // AHB Clock Setup for Active Mode & Sleep
    // Commented-out where the platform defaults (core_main.c) are used.
    //RCC->C2AHB1ENR      = (_CRCCLK_N | _DMAMUXCLK_N | _DMA2CLK_N);
    //RCC->C2AHB1SMENR    = (_CRCCLK_LP | 0x07);

    RCC->C2AHB2ENR      = (_GPIOCLK_SU);
    //RCC->C2AHB2SMENR    = (_GPIOCLK_LP);  // Retain sleep defaults at startup

