jpnorair/OpenTag/include/board/stm32wl55xx/nucleo_wl55.h
    RCC->C2AHB3ENR      = (_FLASHCLK_N | _IPCCCLK_N | _HSEMCLK_N | _RNGCLK_N);
    RCC->C2AHB3SMENR    = (0x03800000 | _RNGCLK_LP | _AESCLK_LP | _PKACLK_LP);
}



//@note BOARD Macro for DMA peripheral enabling
static inline void BOARD_DMA_CLKON(void) {
#ifdef _DMACLK_DYNAMIC
    RCC->C2AHB1ENR |= RCC_C2AHB1ENR_DMA2EN;
#endif
}

static inline void BOARD_DMA_CLKOFF(void) {
#ifdef _DMACLK_DYNAMIC
    RCC->C2AHB1ENR &= ~RCC_C2AHB1ENR_DMA2EN;
#endif
}



/// BOARD Macro for EXTI initialization.
/// This only considers configurable EXTIs that are specific to the BOARD.
/// - GPIO EXTI Configuration.
/// - Interrupt Pre-masking (almost never used)
static inline void BOARD_EXTI_STARTUP(void) {
    // EXTI0-3: PA0 = SW1, PA1 = SW2, Px2 = Unused, PA3 = UART RX Sense
    SYSCFG->EXTICR[0]   = (0 << 0) \
                        | (0 << 4) \
                        | (0 << 8) \
                        | (0 << 12);
    
    // EXTI4-7: Px4 = Unused, Px5 = Unused, PC6 = SW3, Px7 = Unused
    SYSCFG->EXTICR[1]   = (0 << 0) \
                        | (0 << 4) \
                        | (2 << 8) \
                        | (0 << 12);
                        
    // EXTI8-11:
    SYSCFG->EXTICR[2]   = (0 << 0) \
                        | (0 << 4) \
                        | (0 << 8) \
                        | (0 << 12);

    // EXTI12-15:
    SYSCFG->EXTICR[3]   = (0 << 0) \
                        | (0 << 4) \
                        | (0 << 8) \
                        | (0 << 12);
}



/// BOARD Macro for initializing GPIO ports at startup, according to the
/// connections in the schematic of this board.
///
/// @note many of the pins that are broken-out to the connectors are not
///       assigned in this setup.  They can be assigned as needed.
///
static inline void BOARD_PORT_STARTUP(void) {  
    /// Clock all the GPIOs during setup
    RCC->C2AHB2ENR  = _GPIOCLK_SU;

    
    /// Configure Port A IO.  
    // - A0:  Input (pull-up) for SW1
    // - A1:  Input (pull-up) for SW2
    // - A2:  UART-TX, which is ALT push-pull output
    // - A3:  UART-RX, set to input pull-up.  UART driver manages ALT switching.
    // - A4:  Not configured, set as ANALOG
    // - A5:  Not configured, set as ANALOG
    // - A6:  Not configured, set as ANALOG
    // - A7:  Not configured, set as ANALOG
    // - A8:  Not configured, set as ANALOG
    // - A9:  Not configured, set as ANALOG
    // - A10: Not configured, set as ANALOG
    // - A11: Not configured, set as ANALOG
    // - A12: Not configured, set as ANALOG
    // - A13: SWDIO, using ALT
    // - A14: SWDCLK, using ALT
    // - A15: Available as JTDI, using ALT
    
	GPIOA->BSRR     = BOARD_UART_TXPIN;
	
    GPIOA->MODER    = (GPIO_MODER_INPUT  << (0*2)) \
                    | (GPIO_MODER_INPUT  << (1*2)) \
                    | (GPIO_MODER_ALT    << (2*2)) \
                    | (GPIO_MODER_INPUT  << (3*2)) \
                    | (GPIO_MODER_ANALOG << (4*2)) \
                    | (GPIO_MODER_ANALOG << (5*2)) \
                    | (GPIO_MODER_ANALOG << (6*2)) \
                    | (GPIO_MODER_ANALOG << (7*2)) \
                    | (GPIO_MODER_ANALOG << (8*2)) \
                    | (GPIO_MODER_ANALOG << (9*2)) \
                    | (GPIO_MODER_ANALOG << (10*2)) \
                    | (GPIO_MODER_ANALOG << (11*2)) \
                    | (GPIO_MODER_ANALOG << (12*2)) \
                    | (GPIO_MODER_ALT    << (13*2)) \
                    | (GPIO_MODER_ALT    << (14*2)) \
                    | (GPIO_MODER_ALT    << (15*2));
    
    GPIOA->OSPEEDR  = (GPIO_OSPEEDR_10MHz << (2*2)) \
                    | (GPIO_OSPEEDR_10MHz << (3*2)) \
                    | (GPIO_OSPEEDR_40MHz << (13*2)) \
                    | (GPIO_OSPEEDR_40MHz << (14*2));
    
    ///@note sometimes UARTs need to be Open Drain.
    GPIOA->OTYPER   = 0; //(1 << (2)) | (1 << (9));
    
    GPIOA->PUPDR    = (1 << (3*2)) \
                    | (1 << (13*2)) \
                    | (2 << (14*2));
    
    // USART2 on PA2/PA3 = 7
    GPIOA->AFR[0]   = (7 << (BOARD_UART_TXPINNUM*4)) \
                    | (7 << (BOARD_UART_RXPINNUM*4));

    // JTAG/SWD are default AF (0) on their pins, so this can be commented.
	//GPIOA->AFR[1]   = (0 << ((13-8)*4)) \
    //                | (0 << ((14-8)*4)) \
    //                | (0 << ((15-8)*4));

    /// Configure Port B IO.
    // - B0:  TCXO power pin.  Left as floating input.
    // - B1:  Not configured, set as ANALOG
    // - B2:  Not configured, set as ANALOG
    // - B3:  SWO, using ALT
    // - B4:  Not configured, set as ANALOG
    // - B5:  Not configured, set as ANALOG
    // - B6:  Can be EXTUART-TX, but otherwise not configured and set as ANALOG
    // - B7:  Can be EXTUART-RX, but otherwise not configured and set as ANALOG
    // - B8:  Not configured, set as ANALOG
    // - B9:  Not configured, set as ANALOG
    // - B10: Not configured, set as ANALOG
    // - B11: Green LED2 (Trig 1), set as output
    // - B12: Red LED3 (Trig 2), set as output
	// - B13: Not configured, set as ANALOG
    // - B14: Not configured, set as ANALOG
    // - B15: Blue LED1 (Trig 3), set as output

#   if defined(BOARD_EXTUART_PORTNUM)
#       define _MODER_PB6   GPIO_MODER_ALT
#       define _MODER_PB7   GPIO_MODER_ALT
#       define _PUPDR_PB6   1
#       define _OSPEED_PB7  GPIO_OSPEEDR_10MHz
#   else
#       define _MODER_PB6   GPIO_MODER_ANALOG
#       define _MODER_PB7   GPIO_MODER_ANALOG
#       define _PUPDR_PB6   0
#       define _OSPEED_PB7  0
#   endif

    GPIOB->MODER    = (GPIO_MODER_IN        << (0*2)) \
                    | (GPIO_MODER_ANALOG    << (1*2)) \
                    | (GPIO_MODER_ANALOG    << (2*2)) \
                    | (GPIO_MODER_ALT       << (3*2)) \
                    | (GPIO_MODER_ANALOG    << (4*2)) \
                    | (GPIO_MODER_ANALOG    << (5*2)) \
                    | (_MODER_PB6           << (6*2)) \
                    | (_MODER_PB7           << (7*2)) \
                    | (GPIO_MODER_ANALOG    << (8*2)) \
                    | (GPIO_MODER_ANALOG    << (9*2)) \
                    | (GPIO_MODER_ANALOG    << (10*2)) \
                    | (GPIO_MODER_OUT       << (11*2)) \
                    | (GPIO_MODER_OUT       << (12*2)) \
                    | (GPIO_MODER_ANALOG    << (13*2)) \
                    | (GPIO_MODER_ANALOG    << (14*2)) \
                    | (GPIO_MODER_OUT       << (15*2));
    
    // PB0, 1, 2 (RFIOs) should be pullups with high speed, according to STCube
    GPIOB->PUPDR    = (1 << (0*2)) \
                    | (1 << (1*2)) \
                    | (1 << (4*2));
    
    GPIOB->OSPEEDR  = (GPIO_OSPEEDR_10MHz << (0*2)) \
                    | (GPIO_OSPEEDR_10MHz << (1*2)) \
                    | (GPIO_OSPEEDR_40MHz << (3*2)) \
                    | (GPIO_OSPEEDR_10MHz << (4*2)) \
                    | (GPIO_OSPEEDR_10MHz << (8*2)) \
                    | (GPIO_OSPEEDR_10MHz << (9*2));
                    
	GPIOB->AFR[0]   = (0 << ((BOARD_RFSPI_SCLKPINNUM)*4));
    
    /// Configure Port C IO.
    /// Port C is used only for USB sense and 32kHz crystal driving
    // - C0:  Trig4, Output
    // - C1:  Trig5, Output
    // - C2:  Trig6, Output
    // - C3:  RFE Ctl 3, Output, Antenna Switch Power
    // - C4:  RFE Ctl 1, Output, see below
    // - C5:  RFE Ctl 2, Output, 00/01/10/11 = Off, HP-TX, RX, LP-TX
    // - C6:  SW3, Pullup Input
    // - C13: Wakeup (unused), pulldown input
    // - C14: LSE pin, setup as output
    // - C15: LSE pin, setup as Alt

    GPIOC->BSRR     = (1 << 4) | 0;

    GPIOC->MODER    = (GPIO_MODER_OUT    << (0*2)) \
                    | (GPIO_MODER_OUT    << (1*2)) \
                    | (GPIO_MODER_OUT    << (2*2)) \
                    | (GPIO_MODER_OUT    << (3*2)) \
                    | (GPIO_MODER_OUT    << (4*2)) \
                    | (GPIO_MODER_OUT    << (5*2)) \
                    | (GPIO_MODER_IN     << (6*2)) \
                    | (GPIO_MODER_IN     << (13*2)) \
                    | (GPIO_MODER_OUT    << (14*2)) \
                    | (GPIO_MODER_ALT    << (15*2));
    
    GPIOC->PUPDR    = (1 << (6*2)) \
                    | (2 << (13*2));
    
    GPIOC->OSPEEDR  = (GPIO_OSPEEDR_10MHz << (3*2)) \
                    | (GPIO_OSPEEDR_10MHz << (4*2)) \
                    | (GPIO_OSPEEDR_10MHz << (5*2));
    
    /// Configure Port H -- There's nothing to do here.


    /// Clock GPIOs for Normal Runtime
    RCC->C2AHB2ENR  = _GPIOCLK_N;
    
#   undef _MODER_PB6
#   undef _MODER_PB7
#   undef _PUPDR_PB6
#   undef _OSPEED_PB7
}


