jpnorair/OpenTag/include/board/stm32wl55xx/nucleo_wl55.h
/*
static inline void BOARD_OPEN_FLASH(void* start, void* end) {
/// STM32L0 reserves flash on 4KB boundaries
#   define _F_LAST ((FLASH_SIZE-1) >> 12)
    ot_u32 a, b;
    ot_u32 bmask1, bmask2;
    
    // 4KB Boundaries: a to b
    a = ((ot_u32)start - 0x08000000) >> 12;
    b = ((ot_u32)last - 0x08000000) >> 12;
    
    // Make sure a, b are <= _F_LAST. Alter accordingly
    if (a > _F_LAST) a = _F_LAST;
    if (b > _F_LAST) b = _F_LAST;
    
    // Create bitmask from a and b bit positions
    switch ( ((a>=32)<<1) | (b>=32) ) {
        // a < 32, b < 32
        case 0: bmask1  = 1 << a;
                bmask1 |= (bmask1-1);
                bmask1 ^= (1<<b) - 1;
                bmask2  = 0;
                break;
                
        // a < 32, b >= 32
        case 1: bmask1  = 1 << a;
                bmask1 |= (bmask1-1);
                bmask2  = 1 << b;
                bmask2 |= ~(bmask2-1);
                break;
        
        // a >= 32, b < 32 -- implausible
        case 2: return;
        
        // a >= 32, b >= 32
        case 3: bmask1  = 0;
                bmask2  = 1 << a;
                bmask2 |= (bmask2-1);
                bmask2 ^= (1<<b) - 1;
                break;
        
    }
    
    // Apply bitmasks to WRPROT registers
    
    //FLASH->WRPROT1  = __REV(bmask1);
    //FLASH->WRPROT2  = __REV(bmask2);
}
*/


static inline void BOARD_RFANT_OFF(void) {
/// PC4:5 set to isolation, then PC3 set to analog (Hi-Z)
    GPIOC->BSRR     = ((1<<4) | (1<<5)) << 16;
    GPIOC->MODER    = GPIOC->MODER | (3 << (3*2));
}


static inline void BOARD_RFANT_ON(void) {
/// PC4:5 set to isolation, then PC3 set to output 1
    GPIOC->BSRR     = (1<<3) | (((1<<4) | (1<<5)) << 16);
    GPIOC->MODER    = (GPIOC->MODER & ~(3 << (3*2))) | (1 << (3*2));
}

static inline void BOARD_RFANT_TX(ot_bool use_boost) {
/// PC4:5 00/01/10/11 = Off, HP-TX, RX, LP-TX
    GPIOC->BSRR = (1<<5) | ((ot_32)use_boost << 16);
}

static inline void BOARD_RFANT_RX(void) {
    GPIOC->BSRR = (1<<4) | ((1<<5) << 16);
}



static inline void BOARD_RFSPI_CLKON(void) {
    RCC->C2APB3ENR = RCC_APB3ENR_SUBGHZSPIEN;
}

static inline void BOARD_RFSPI_CLKOFF(void) {
    RCC->C2APB3ENR = 0;
}



static inline void BOARD_STOP(ot_int code) {
/// Put the device in STOP2, which is similar to "STOP" on other STM32.
/// Usage:
/// "code" comes from sys_sig_powerdown, but it is usually 0-3.
/// - code = 0 or 1: This function should not be called with 0-1
/// - code = 2: Keep ports alive with peripherals that can be active in STOP
/// - code = 3: Shut down all ports, only
/// Those are the only modes that should call this inline function.
    static const ot_u32 rcc_flags[2] = {
        _GPIOCLK_LPRF,
        _GPIOCLK_LP
    };
    ot_u32  rcc_ahb2enr_saved;
    
    // Shut down unnecessary ports
    rcc_ahb2enr_saved   = RCC->C2AHB2ENR;
    RCC->C2AHB2ENR      = rcc_flags[code&1];
    
    // Disable Systick.  Systick is the devil.
    SysTick->CTRL = 0;
    
    // Prepare SCB->SCR register for DeepSleep instead of regular Sleep.
    SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;
    
    // Prepare PWR->C2CR1 register for Stop2 Mode
    // - Flash Power Down Enabled
    // - Stop Mode 2
    PWR->C2CR1 = PWR_C2CR1_FPDS | 2;
    
    // Assure PVD is in low power mode.
    ///@note PWR->CR3 is under purview of CPU1, might comment-out later
    PWR->CR3 |= PWR_CR3_ULPEN;

    // Clear any EXTIs -- too late for them now
    ///@todo need to mask erase only the C2 EXTIs
    EXTI->PR1   = 0;
    EXTI->PR2   = 0;
    
    // Enable Interrupts and send "Wait For Interrupt" Cortex-M instruction
    platform_enable_interrupts();
    __WFI();
    
    // ---- Device is in STOP mode here ---- //
    
    // On Wakeup (from STOP) clear flags, re-enable backup register area, 
    // immediately reset SLEEPDEEP bit, and Re-enable Ports
    PWR->C2CR1      = 2;
    SCB->SCR       &= ~((ot_u32)SCB_SCR_SLEEPDEEP_Msk);
    //PWR->CR1     |= PWR_CR1_DBP;      // re-enable backup registers

    ///@note PWR->CR3 is under purview of CPU1, might comment-out later
    PWR->CR3       &= ~PWR_CR3_ULPEN;

    RCC->C2AHB2ENR  = rcc_ahb2enr_saved;
}





static inline void BOARD_PORT_STANDBY() {
///@todo implement this!
}




/// Macro for initializing powering resources, especially the PVD.
static inline void BOARD_POWER_STARTUP(void) {
#   if MCU_PARAM(CPU2PWR)
    PWR->CR1    = PWR->CR1
                & ~PWR_CR1_LPR
                & ~PWR_CR1_SUBGHZSPINSSSEL
                & ~0x7
                |  PWR_CR1_FPDS
                |  2;   // Force Stop2 on CPU1

    PWR->CR3    = PWR->CR3
                | PWR_CR3_APC
                | PWR_CR3_RRS;

    PWR->CR4    = PWR->CR4
                & ~PWR_CR4_WRFBUSYP;

    ///@todo Before enabling the SMPS, the SMPS clock detection must be enabled
    ///      in the sub-GHz radio SUBGHZ_SMPSC0R.CLKDE
    PWR->CR5    = 0 /* PWR_CR5_SMPSEN*/
                | 0 /* PWR_CR5_RFEOLEN */ ;

#       if MCU_FEATURE(SVMONITOR)
        ///@todo there's a note in the Ref Manual about SYSCFG->CBR
        //SYSCFG->CBR = ??;

        // - PVM3 checks Vdda against 1.62V.
        // - PLS[2:0] is the voltage threshold, 2.0 - 2.9V (values 0-6).
        //   The setting 5 is 2.8V, which is a good cutoff for Li-Ion.
        PWR->CR2    = 0 /* PWR_CR2_PVME3 */
                    | (5<<1)
                    |  PWR_CR2_PVDE;
#       endif

#   endif

#   if MCU_PARAM(CPU1NULL)
        ///@note EWRFBUSY might not be needed
        PWR->C2CR3  = PWR_C2CR3_EWRFIRQ
                    | PWR_C2CR3_EWRFBUSY
                    | PWR_C2CR3_EWPVD;
#   else
        PWR->C2CR3  = PWR_C2CR3_EIWUL
                    | PWR_C2CR3_EWRFIRQ
                    | PWR_C2CR3_EWRFBUSY;
#   endif

    PWR->SECCFGR    = PWR_SECCFGR_C2EWILA;
}



///@note BOARD Macro for initializing the STM32 Crystal startup routine, done
///      at startup.  It must startup ALL the crystals that you want to run 
///      during normal operation.
static inline void BOARD_XTAL_STARTUP(void) {
}


///@note BOARD Macros for turning-on and turning-off the High-speed XTAL.
///      High speed XTAL on this board is connected to the RF subsystem.
static inline void BOARD_HSXTAL_ON(void) {
}
static inline void BOARD_HSXTAL_OFF(void) {
}




///@todo Create a more intelligent setup that knows how to use the UART
/// BOARD Macros for Com module interrupt vectoring.  Connect these to
/// the Com interface driver you are using.  Check the schematic of your
/// board to see where the Com IRQ lines are routed.
#if (MCU_CONFIG(MPIPEUART) && OT_FEATURE(MPIPE) && BOARD_FEATURE(MPIPE) && BOARD_FEATURE(MPIPE_BREAK))
#   define __USE_EXTI3
#   define _UART_RXSYNC_ISR()       mpipe_rxsync_isr()
#else
#   define _UART_RXSYNC_ISR()       ;
#endif

#define BOARD_COM_EXTI0_ISR();
#define BOARD_COM_EXTI1_ISR();
#define BOARD_COM_EXTI2_ISR();
#define BOARD_COM_EXTI3_ISR()   _UART_RXSYNC_ISR()
#define BOARD_COM_EXTI4_ISR();
#define BOARD_COM_EXTI5_ISR();
#define BOARD_COM_EXTI6_ISR();     
#define BOARD_COM_EXTI7_ISR();     
#define BOARD_COM_EXTI8_ISR();     
#define BOARD_COM_EXTI9_ISR();
#define BOARD_COM_EXTI10_ISR();
#define BOARD_COM_EXTI11_ISR();
#define BOARD_COM_EXTI12_ISR();
#define BOARD_COM_EXTI13_ISR();
#define BOARD_COM_EXTI14_ISR();
#define BOARD_COM_EXTI15_ISR();





/** Note: Clocking for the Board's MCU      <BR>
  * ========================================================================<BR>
  * This STM32WL impl is clocked at 48 MHz @ 1.2V core voltage, using the MSI.
  * It also uses the LSE for 32768 Hz generation.
  * The other settings here (HS, PLL, etc) are kept around from other boards,
  * but they are unused.
  */
#define MCU_CONFIG_LFXTALHz          BOARD_PARAM_LFHz
#define MCU_CONFIG_LFXTALtol         BOARD_PARAM_LFtol
//#define MCU_CONFIG_LFOSCHz           BOARD_PARAM_LFHz
//#define MCU_CONFIG_LFOSCtol          BOARD_PARAM_LFtol
//#define MCU_CONFIG_XTALHz            BOARD_PARAM_HFHz
//#define MCU_CONFIG_XTALmult          BOARD_PARAM_HFmult
//#define MCU_CONFIG_XTALtol           BOARD_PARAM_HFtol
#define MCU_CONFIG_OSCHz             BOARD_PARAM_HFHz
#define MCU_CONFIG_OSCmult           BOARD_PARAM_HFmult
#define MCU_CONFIG_OSCtol            BOARD_PARAM_HFtol

#define PLATFORM_MCLK_DIV           BOARD_PARAM_MCLKDIV
#define PLATFORM_SMCLK_DIV          BOARD_PARAM_SMCLKDIV

