jpnorair/OpenTag/include/board/stm32wl55xx/nucleo_wl55.h
#define PLATFORM_LSCLOCK_PINS       BOARD_LFXT_PINS
#define PLATFORM_LSCLOCK_CONF       BOARD_LFXT_CONF
#define PLATFORM_HSCLOCK_PINS       BOARD_HFXT_PINS
#define PLATFORM_HSCLOCK_CONF       BOARD_HFXT_CONF
#define PLATFORM_LSCLOCK_HZ         BOARD_PARAM_LFHz
#define PLATFORM_LSCLOCK_ERROR      BOARD_PARAM_LFtol
#define PLATFORM_MSCLOCK_HZ         (BOARD_PARAM_MFHz)
#define PLATFORM_MSCLOCK_ERROR      BOARD_PARAM_MFtol
#define PLATFORM_HSCLOCK_HZ         BOARD_PARAM_HFHz
#define PLATFORM_HSCLOCK_ERROR      BOARD_PARAM_HFtol
#define PLATFORM_PLLCLOCK_OUT       ((BOARD_PARAM_RFHz/BOARD_PARAM_RFdiv)*BOARD_PARAM_PLLmult)
#define PLATFORM_PLLCLOCK_HZ        (PLATFORM_PLLCLOCK_OUT/BOARD_PARAM_PLLdiv)
#define PLATFORM_PLLCLOCK_ERROR     BOARD_PARAM_RFtol




/** Peripheral definitions for this platform <BR>
  * ========================================================================<BR>
  * <LI> OT_GPTIM:  "General Purpose Timer" used by OpenTag kernel and other
  *                   internal stuff (sometimes Radio MAC timer). </LI>
  * <LI> OT_TRIG:   Optional test trigger(s) usable in OpenTag apps.  Often the 
  *                   triggers are implemented on LED pins.  Trig1 is usually
  *                   green (typ 570nm) and Trig2 orange (typ 605nm). </LI>
  * <LI> OT_SWITCH: Optional input switches/sources.  Usually there is at least
  *                   one.  Many apps (especially demos) require a button. </LI>
  * <LI> OT_GWNADC: Optional floating pin or other type of noise source that 
  *                   can be used with ADC-based true-random-number generator </LI>
  * <LI> OT_GWNDRV: Optional driver pin to power some sort of noise source </LI>
  * <LI> MPIPE:     The wireline interface, usually either UART or USB-CDC, but 
  *                   possible to use with a multi-master I2C or SPI as well </LI>
  */

///@note The defaults (commented below) are set in STM32WLxx_config.h  If you
///      want to make changes, you should undef the defines needing changes
///      and define them again below.

///@note STM32WL RTC clocking impl uses a raw period of 1/32768 Hz
///      OpenTag's tick is (generally) 1/1024 sec.
///      Thus the setting here is SHIFT=0, OVERSAMPLE=5
//#define __ISR_RTC_Alarm
//#define OT_GPTIM_ID         'R'
//#define OT_GPTIM            RTC
//#define OT_GPTIM_CLOCK      32768
//#define OT_GPTIM_SHIFT      0
//#define OT_GPTIM_OVERSAMPLE 5
//#define OT_GPTIM_RES        (1024 << OT_GPTIM_SHIFT)    //1024
//#define TI_TO_CLK(VAL)      ((OT_GPTIM_RES/1024)*VAL)
//#define CLK_TO_TI(VAL)      (VAL/(OT_GPTIM_RES/1024))

#if (OT_GPTIM_CLOCK == BOARD_PARAM_LFHz)
#   define OT_GPTIM_ERROR   BOARD_PARAM_LFtol
#else
#   define OT_GPTIM_ERROR   BOARD_PARAM_HFtol
#endif

//this needs to be hard-coded
#define OT_GPTIM_ERRDIV         32768

#define OT_KTIM_IRQ_SRCLINE     BOARD_GPTIM1_PINNUM
#define OT_MACTIM_IRQ_SRCLINE   BOARD_GPTIM2_PINNUM



// Primary LED triggers
#define OT_TRIG1_PORT       BOARD_LEDG_PORT
#define OT_TRIG1_PINNUM     BOARD_LEDG_PINNUM
#define OT_TRIG1_PIN        BOARD_LEDG_PIN
#define OT_TRIG1_POLARITY   BOARD_LEDG_POLARITY
#define OT_TRIG2_PORT       BOARD_LEDR_PORT
#define OT_TRIG2_PINNUM     BOARD_LEDR_PINNUM
#define OT_TRIG2_PIN        BOARD_LEDR_PIN
#define OT_TRIG2_POLARITY   BOARD_LEDR_POLARITY
#define OT_TRIG3_PORT       BOARD_LEDB_PORT
#define OT_TRIG3_PINNUM     BOARD_LEDB_PINNUM
#define OT_TRIG3_PIN        BOARD_LEDB_PIN
#define OT_TRIG3_POLARITY   BOARD_LEDB_POLARITY

// Secondary pin triggers
#define OT_TRIG4_PORT       BOARD_TRIG4_PORT
#define OT_TRIG4_PINNUM     BOARD_TRIG4_PINNUM
#define OT_TRIG4_PIN        BOARD_TRIG4_PIN
#define OT_TRIG4_POLARITY   1
#define OT_TRIG5_PORT       BOARD_TRIG5_PORT
#define OT_TRIG5_PINNUM     BOARD_TRIG5_PINNUM
#define OT_TRIG5_PIN        BOARD_TRIG5_PIN
#define OT_TRIG5_POLARITY   1
#define OT_TRIG6_PORT       BOARD_TRIG6_PORT
#define OT_TRIG6_PINNUM     BOARD_TRIG6_PINNUM
#define OT_TRIG6_PIN        BOARD_TRIG6_PIN
#define OT_TRIG6_POLARITY   1



#define OT_TRIG(NUM, SET)   OT_TRIG##NUM##_##SET##()

#if (OT_TRIG1_POLARITY != 0)
#   define OT_TRIG1_ON()    OT_TRIG1_PORT->BSRR  = OT_TRIG1_PIN;
#   define OT_TRIG1_OFF()   OT_TRIG1_PORT->BRR   = OT_TRIG1_PIN;
#   define OT_TRIG1_TOG()   OT_TRIG1_PORT->ODR  ^= OT_TRIG1_PIN;
#else 
#   define OT_TRIG1_ON()    OT_TRIG1_PORT->BRR   = OT_TRIG1_PIN;
#   define OT_TRIG1_OFF()   OT_TRIG1_PORT->BSRR  = OT_TRIG1_PIN;
#   define OT_TRIG1_TOG()   OT_TRIG1_PORT->ODR  ^= OT_TRIG1_PIN;
#endif

#if (OT_TRIG2_POLARITY != 0)
#   define OT_TRIG2_ON()    OT_TRIG2_PORT->BSRR  = OT_TRIG2_PIN;
#   define OT_TRIG2_OFF()   OT_TRIG2_PORT->BRR   = OT_TRIG2_PIN;
#   define OT_TRIG2_TOG()   OT_TRIG2_PORT->ODR  ^= OT_TRIG2_PIN;
#else 
#   define OT_TRIG2_ON()    OT_TRIG2_PORT->BRR   = OT_TRIG2_PIN;
#   define OT_TRIG2_OFF()   OT_TRIG2_PORT->BSRR  = OT_TRIG2_PIN;
#   define OT_TRIG2_TOG()   OT_TRIG2_PORT->ODR  ^= OT_TRIG2_PIN;
#endif

#if (OT_TRIG3_POLARITY != 0)
#   define OT_TRIG3_ON()    OT_TRIG3_PORT->BSRR  = OT_TRIG3_PIN;
#   define OT_TRIG3_OFF()   OT_TRIG3_PORT->BRR   = OT_TRIG3_PIN;
#   define OT_TRIG3_TOG()   OT_TRIG3_PORT->ODR  ^= OT_TRIG3_PIN;
#else 
#   define OT_TRIG3_ON()    OT_TRIG3_PORT->BRR   = OT_TRIG3_PIN;
#   define OT_TRIG3_OFF()   OT_TRIG3_PORT->BSRR  = OT_TRIG3_PIN;
#   define OT_TRIG3_TOG()   OT_TRIG3_PORT->ODR  ^= OT_TRIG3_PIN;
#endif

#if (OT_TRIG4_POLARITY != 0)
#   define OT_TRIG4_ON()    OT_TRIG4_PORT->BSRR  = OT_TRIG4_PIN;
#   define OT_TRIG4_OFF()   OT_TRIG4_PORT->BRR   = OT_TRIG4_PIN;
#   define OT_TRIG4_TOG()   OT_TRIG4_PORT->ODR  ^= OT_TRIG4_PIN;
#else 
#   define OT_TRIG4_ON()    OT_TRIG4_PORT->BRR   = OT_TRIG4_PIN;
#   define OT_TRIG4_OFF()   OT_TRIG4_PORT->BSRR  = OT_TRIG4_PIN;
#   define OT_TRIG4_TOG()   OT_TRIG4_PORT->ODR  ^= OT_TRIG4_PIN;
#endif

#if (OT_TRIG5_POLARITY != 0)
#   define OT_TRIG5_ON()    OT_TRIG5_PORT->BSRR  = OT_TRIG5_PIN;
#   define OT_TRIG5_OFF()   OT_TRIG5_PORT->BRR   = OT_TRIG5_PIN;
#   define OT_TRIG5_TOG()   OT_TRIG5_PORT->ODR  ^= OT_TRIG5_PIN;
#else 
#   define OT_TRIG5_ON()    OT_TRIG5_PORT->BRR   = OT_TRIG5_PIN;
#   define OT_TRIG5_OFF()   OT_TRIG5_PORT->BSRR  = OT_TRIG5_PIN;
#   define OT_TRIG5_TOG()   OT_TRIG5_PORT->ODR  ^= OT_TRIG5_PIN;
#endif

#if (OT_TRIG6_POLARITY != 0)
#   define OT_TRIG6_ON()    OT_TRIG6_PORT->BSRR  = OT_TRIG6_PIN;
#   define OT_TRIG6_OFF()   OT_TRIG6_PORT->BRR   = OT_TRIG6_PIN;
#   define OT_TRIG6_TOG()   OT_TRIG6_PORT->ODR  ^= OT_TRIG6_PIN;
#else 
#   define OT_TRIG6_ON()    OT_TRIG6_PORT->BRR   = OT_TRIG6_PIN;
#   define OT_TRIG6_OFF()   OT_TRIG6_PORT->BSRR  = OT_TRIG6_PIN;
#   define OT_TRIG6_TOG()   OT_TRIG6_PORT->ODR  ^= OT_TRIG6_PIN;
#endif

static inline void BOARD_led1_on(void)      { OT_TRIG1_ON(); }
static inline void BOARD_led1_off(void)     { OT_TRIG1_OFF(); }
static inline void BOARD_led1_toggle(void)  { OT_TRIG1_TOG(); }
static inline void BOARD_led2_on(void)      { OT_TRIG2_ON(); }
static inline void BOARD_led2_off(void)     { OT_TRIG2_OFF(); }
static inline void BOARD_led2_toggle(void)  { OT_TRIG2_TOG(); }
static inline void BOARD_led3_on(void)      { OT_TRIG3_ON(); }
static inline void BOARD_led3_off(void)     { OT_TRIG3_OFF(); }
static inline void BOARD_led3_toggle(void)  { OT_TRIG3_TOG(); }



