jpnorair/OpenTag/include/board/stm32wl55xx/nucleo_wl55.h
#ifndef __ISR_EXTI0
#   define __ISR_EXTI0
#endif
#define OT_SWITCH1_ISR      platform_isr_exti0
#define OT_SWITCH1_PORTNUM  BOARD_SW1_PORTNUM
#define OT_SWITCH1_PORT     BOARD_SW1_PORT
#define OT_SWITCH1_PINNUM   BOARD_SW1_PINNUM
#define OT_SWITCH1_PIN      BOARD_SW1_PIN
#define OT_SWITCH1_POLARITY BOARD_SW1_POLARITY
 
#ifndef __ISR_EXTI1
#   define __ISR_EXTI1
#endif
#define OT_SWITCH2_ISR      platform_isr_exti1
#define OT_SWITCH2_PORTNUM  BOARD_SW2_PORTNUM
#define OT_SWITCH2_PORT     BOARD_SW2_PORT
#define OT_SWITCH2_PINNUM   BOARD_SW2_PINNUM
#define OT_SWITCH2_PIN      BOARD_SW2_PIN
#define OT_SWITCH2_POLARITY BOARD_SW2_POLARITY

#ifndef __ISR_EXTI6
#   define __ISR_EXTI6
#endif
#define OT_SWITCH3_ISR      platform_isr_exti6
#define OT_SWITCH3_PORTNUM  BOARD_SW3_PORTNUM
#define OT_SWITCH3_PORT     BOARD_SW3_PORT
#define OT_SWITCH3_PINNUM   BOARD_SW3_PINNUM
#define OT_SWITCH3_PIN      BOARD_SW3_PIN
#define OT_SWITCH3_POLARITY BOARD_SW3_POLARITY



/** STM32L0 MPipe Setup <BR>
  * ========================================================================<BR>
  * USB MPipe requires a CDC firmware library subsystem, which typically uses
  * memcpy to move data across HW buffers and such, and memcpy typically is
  * implemented using a DMA.  
  *
  * UART MPipe standard drivers REQUIRE DMA CHANNELS FOR RX AND TX.  You could
  * re-implement them without DMA, but this will impact the performance in a
  * very negative way and is not recommended.
  */
#if (OT_FEATURE(MPIPE) && BOARD_FEATURE(MPIPE))

#   ifdef __USE_DMA2_CHAN7
#       error "Resource collision on DMA2-Channel7 (MPIPE)."
#   else
#       define MPIPE_DMANUM         2
#       define MPIPE_DMA            DMA2
#       define MPIPE_DMA_RXCHAN_ID  14
#       define MPIPE_DMA_TXCHAN_ID  14
#       define __USE_DMA2_CHAN7
#   endif

#	if MCU_CONFIG(MPIPEUART)
#       define MPIPE_UART_ID        BOARD_UART_ID
#       define MPIPE_UART_PORTNUM   BOARD_UART_PORTNUM
#       define MPIPE_UART_PORT      BOARD_UART_PORT
#       define MPIPE_UART_RXPIN     BOARD_UART_RXPIN
#       define MPIPE_UART_TXPIN     BOARD_UART_TXPIN
#       define MPIPE_RTS_PORT       BOARD_UART_PORT
#       define MPIPE_CTS_PORT       BOARD_UART_PORT
#       define MPIPE_RTS_PIN        BOARD_UART_RTSPIN
#       define MPIPE_CTS_PIN        BOARD_UART_CTSPIN
#       define MPIPE_UART_PINS      (MPIPE_UART_RXPIN | MPIPE_UART_TXPIN)
#       if (MPIPE_UART_ID != 2)
#           error "MPIPE UART must be on USART2 for this board."
#       endif
#       ifndef __ISR_USART2
#           define __ISR_USART2
#       endif
#       define MPIPE_UART           USART2

#	elif MCU_CONFIG(MPIPEI2C)
#       define MPIPE_I2C_ID         BOARD_I2C_ID
#       define MPIPE_I2C            I2C2
#       define MPIPE_I2C_PORTNUM    BOARD_I2C_PORTNUM
#       define MPIPE_I2C_PORT       BOARD_I2C_PORT
#       define MPIPE_I2C_RXPIN      BOARD_I2C_SCLPIN
#       define MPIPE_I2C_TXPIN      BOARD_I2C_SDAPIN
#       define MPIPE_I2C_PINS       (MPIPE_I2C_RXPIN | MPIPE_I2C_TXPIN)
#       if (MPIPE_I2C_ID != 2)
#           error "MPIPE I2C must be on I2C2 for this board."
#       endif
#   endif

#endif








/** RF interface setup <BR>
  * ========================================================================<BR>
  * Unlike with external radios, the signals in the STM32WL between radio core
  * and MCU are internal, not GPIOs.  So there is no GPIO configuration to do,
  * all configurations can happen uniquely inside driver code.
  *
  * - STM32WL has integrated RF accessible via AHB3.
  * - The SUBGHZSPI driver implementation is:
  *   - blocking (no interrupts)
  *   - uses DMAs
  * - The Available IRQs are internal signals rather than GPIOs
  *   - Set PWR->C2CR3.EWRFIRQ to enable the Radio DIO IRQ
  *   - Set PWR->C2CR3.EWRFBUSY to enable the Radio Busy to make IRQ
  *   - EXTI line 44 is the Global RFIRQ line (DIO0, 1, 2)
  *   - EXTI line 45 is the RFBUSY line
  * - The underlying signals are available:
  *   - RF-Reset (set) via RCC->CSR.RFRST
  *   - RF-Reset (check) via RCC->CSR.RFRSTF
  *   - Individual DIO signals NOT available, status must be read via SPI
  *   - Check PWR->SR2.RFBUSYS for radio state machine status (see 126x datasheet)
  *   - Check PWR->SR2.RFBUSYMS as RFBUSYS + RFSPI bus busy
  */
 
#ifdef __USE_RADIO
#   define RADIO_SPI_ID     BOARD_RFSPI_ID
#   define RADIO_SPI        SUBGHZSPI

#   if (BOARD_RFSPI_ID != 3)
#       error "RADIO_SPI must be SPI3 (SUBGHZSPI) on this board"
#   endif
#   if (defined(__USE_DMA2_CHAN5) || defined(__USE_DMA2_CHAN6))
#       error "RADIO SPI implementation requires DMA2-Ch5, DMA2-Ch6 to be free"

#   else
#       define __USE_DMA2_CHAN5
#       define __USE_DMA2_CHAN6
#       define __N_ISR_DMA2_Channel5
#       define __N_ISR_DMA2_Channel6
#   endif


#endif



/** Boilerplate STM32L DMA Memcpy Setup <BR>
  * ========================================================================<BR>
  * Memcpy is a MEM2MEM function of the DMA, so it can take any channel.
  *
  */
#if (MCU_CONFIG_MEMCPYDMA != ENABLED)
#   warning "Not using DMA for MEMCPY, a sub-optimal design choice."
#elif !defined(__USE_DMA2_CHAN7)
#   define MEMCPY_DMA_CHAN_ID   14
#   define MEMCPY_DMA           DMA2
#   define MEMCPY_DMACHAN       DMA2_Channel7
#   define __USE_DMA2_CHAN7
#elif !defined(__USE_DMA2_CHAN6)
#   define MEMCPY_DMA_CHAN_ID   13
#   define MEMCPY_DMA           DMA2
#   define MEMCPY_DMACHAN       DMA2_Channel6
#   define __USE_DMA2_CHAN6
#elif !defined(__USE_DMA2_CHAN5)
#   define MEMCPY_DMA_CHAN_ID   12
#   define MEMCPY_DMA           DMA2
#   define MEMCPY_DMACHAN       DMA2_Channel5
#   define __USE_DMA2_CHAN5
#elif !defined(__USE_DMA2_CHAN4)
#   define MEMCPY_DMA_CHAN_ID   11
#   define MEMCPY_DMA           DMA2
#   define MEMCPY_DMACHAN       DMA2_Channel4
#   define __USE_DMA2_CHAN4
#elif !defined(__USE_DMA2_CHAN3)
#   define MEMCPY_DMA_CHAN_ID   10
#   define MEMCPY_DMA           DMA2
#   define MEMCPY_DMACHAN       DMA2_Channel3
#   define __USE_DMA2_CHAN3
#elif !defined(__USE_DMA2_CHAN2)
#   define MEMCPY_DMA_CHAN_ID   9
#   define MEMCPY_DMA           DMA2
#   define MEMCPY_DMACHAN       DMA2_Channel2
#   define __USE_DMA2_CHAN2
#elif !defined(__USE_DMA2_CHAN1)
#   define MEMCPY_DMA_CHAN_ID   8
#   define MEMCPY_DMA           DMA2
#   define MEMCPY_DMACHAN       DMA2_Channel1
#   define __USE_DMA2_CHAN1
#else
#   error "There is no available DMA Channel to allocate to MEMCPY."
#endif






/** EXTI Line Utilization declaration <BR>
  * ========================================================================<BR>
  * For this board, we do not open-up the rest of the EXTIs for application
  * usage, because the purpose of OpenTag on the STM32WL M0+ core is only to
  * provide a radio layer.  User apps should be in the M4.

#ifndef __USE_EXTI0
#   define __USE_EXTI0
#endif
#ifndef __USE_EXTI1
#   define __USE_EXTI1
#endif
#ifndef __USE_EXTI2
#   define __USE_EXTI2
#endif
#ifndef __USE_EXTI3
#   define __USE_EXTI3
#endif
#ifndef __USE_EXTI4
#   define __USE_EXTI4
#endif
#ifndef __USE_EXTI5
#   define __USE_EXTI5
#endif
#ifndef __USE_EXTI6
#   define __USE_EXTI6
#endif
#ifndef __USE_EXTI7
#   define __USE_EXTI7
#endif
#ifndef __USE_EXTI8
#   define __USE_EXTI8
#endif
#ifndef __USE_EXTI9
#   define __USE_EXTI9
#endif
#ifndef __USE_EXTI10
#   define __USE_EXTI10
#endif
#ifndef __USE_EXTI11
#   define __USE_EXTI11
#endif
#ifndef __USE_EXTI12
#   define __USE_EXTI12
#endif
#ifndef __USE_EXTI13
#   define __USE_EXTI13
#endif
#ifndef __USE_EXTI14
#   define __USE_EXTI14
#endif
#ifndef __USE_EXTI15
#   define __USE_EXTI15
#endif
*/

//Wipe-out some temporary constants which have generic names
#undef _CRYPCLK_N
#undef _CRYPCLK_LP 
#undef _RNGCLK_N 
#undef _RNGCLK_LP 
#undef _TOUCHCLK_N 
#undef _TOUCHCLK_LP 
#undef _CRCCLK_N
#undef _CRCCLK_LP 
#undef _SRAMCLK_LP 
#undef _MIFCLK_N
#undef _MIFCLK_LP 
#undef _DMACLK_N  
#undef _DMACLK_LP 
#undef _DMACLK_DYNAMIC
#undef _GPIOCLK_N 
#undef _GPIOCLK_SU 
#undef _GPIOCLK_LP 
#undef _IOPENR_STARTUP 
#undef _IOPENR_RUNTIME 





/** Trailing Header Includes <BR>
  * ========================================================================<BR>
  * These must occur AFTER all the above has been defined
  */
#ifdef __USE_RADIO
#	include <io/stm32wl_lora/interface.h>
#endif


#endif
